In [3]:
 
# importing pandas as pd
import pandas as pd
  
# dictionary of lists
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}
  
df = pd.DataFrame(dict, index = [True, False, True, False])
  
df

         name  degree  score
True   aparna     MBA     90
False  pankaj     BCA     40
True   sudhir  M.Tech     80
False   Geeku     MBA     98

In [4]:
df.loc[True]

        name  degree  score
True  aparna     MBA     90
True  sudhir  M.Tech     80

In [5]:
df.iloc[True]

TypeError: Cannot index by location index with a non-integer key

In [6]:
df.iloc[1]

name      pankaj
degree       BCA
score         40
Name: False, dtype: object

### Applying a boolean mask to a dataframe :

In [7]:
import pandas as pd
  
# dictionary of lists
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}
  
df = pd.DataFrame(dict, index = [0, 1, 2, 3])
df

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

In [8]:
df[[True,False,False,True]]

     name degree  score
0  aparna    MBA     90
3   Geeku    MBA     98